Repository: 84000/translation-memory-resources
Catalog: post_input/toh70.bo.en.tmx
Source language: bo
Languages: en

source: གང་ ད་ལྟ ར་ བྱུང་བ འི་ དུས་ ཀྱི་ ཕུང་པོ་ དང་ །_ ཁམས་ དང་ །_ སྐྱེ་མཆེད་ དེ་ ནི་ མི་ གནས་པ །_ མི་ འདུག་པ འོ །_།
en: All present aggregates, sensory elements, and sense spheres neither remain nor endure.

source: འཇིག་རྟེན་ ནི་ སྐད་ཅིག་ ལས་ ལྷག་པ ར་ མི་ གནས་པ འི་ ཕྱིར་ རོ །_།
en: It is because the world does not remain for more than a moment.

source: སྐད་ཅིག་པ་ དེ འི་ སྐྱེ་བ འི་ དུས་ ཀྱང་ གཞན །_ གནས་པ འི་ དུས་ ཀྱང་ གཞན །_ འགག་པ འི་ དུས་ ཀྱང་ གཞན་ གང་ཡིན་པ འི་ སྐད་ཅིག་ དེ་ ནི་ གནས་པ་ མེད་པ །_ འདུག་པ་ མེད་པ འོ །_།
en: And that moment itself, whose time of arising, remaining, and ceasing are all separate, neither remains nor endures.

source: སྐད་ཅིག་ གི་ དུས་ གང་ཡིན་པ་ དེ་ ནི་ ནང་ དང་ ཕྱི འི་ ཕུང་པོ་ དང་ །_ ཁམས་ དང་ སྐྱེ་མཆེད་ དོ །_།
en: The duration of a moment is in terms of the inner and outer aggregates, the sensory elements, and the sense spheres.

source: ནང་ དང་ ཕྱི འི་ ཕུང་པོ་ དང་ །_ ཁམས་ དང་ །_ སྐྱེ་མཆེད་ གང་ཡིན་པ་ དེ་ ནི་ དུས་ སོ །_།
en: The inner and outer aggregates, the sensory elements, and the sense spheres exist in terms of duration.

source: ད་ལྟ ར་ བྱུང་བ འི་ ཕུང་པོ་ དང་ །_ ཁམས་ དང་ །_ སྐྱེ་མཆེད་ གང་ཡིན་པ་ དེ་ ནི་ སྐད་ཅིག་ ཙམ་ ཡང་ མི་ གནས་པ་ མི་ འདུག་པ་ སྟེ །_
en: The present aggregates, sensory elements, and sense spheres neither remain nor endure for even a mere moment,

source: མི་ གནས་པ་ མི་ འདུག་པ་ ལ་ ནི་ བདག་ གམ་ བདག་ གི་བ་ མེད་ དོ །_།
en: and that which neither remains nor endures is devoid of a self and anything belonging to a self.

source: དེ་ཡང་ གང་ གི་ ཚེ་ མ་འོངས་པ ར་ གྱུར་པ་ དེ འི་ ཚེ་ མ་ སྐྱེས་པ་ དང་ །_ མ་བྱུང་བ་ ཡོད་པ་ མ་ཡིན་པ འོ །_།
en: Moreover, the future has not arisen, appeared, or come into existence,

source: བདག་ ཏུ་ མ་ གྱུར་ ཅིང་ བདག་ གིར་ མ་ གྱུར་པ འོ །_།
en: so it is devoid of a self and anything belonging to a self.

source: གང་ གི་ ཚེ་ འདས་ ཏེ་ འགགས་པ་ དང་ །_ མ་ བྱུང་ སྟེ་ ཡོད་པ་ མ་ཡིན་པ ར་ འགྱུར་བ་ དེ འི་ ཚེ་ ཡང་ བདག་མེད་པ་ དང་ །_ བདག་ གི་ མེད་པ་ ཉིད་ དུ་ འགྱུར་ རོ །_།
en: Moreover, the past is over, not arisen, and does not exist, so it is naturally devoid of a self and anything belonging to a self.

source: གང་ཡང་ དུས་གསུམ་ དག་ ཏུ་ བདག་མེད་ ཅིང་ བདག་ གི་ མེད་པ་ དེ་ ནི་ མ་ བྱུང་ ཞིང་ ཡོད་པ་ མ་ཡིན་པ འི་ ཕྱིར་ མཁས་ ཤིང་ རིག་པ་ རྣམས་ ཀྱིས་ འདི་ ནི་ བདག་ གིའོ །_། འདི་ ནི་ ང འོ །_། |#| བདག་ གི་ འདི་ ནི་ ཡོད་ དོ་ ཞེས་ བདག་ ཏུ་ ལྟ་བ ར་ འོས་པ་ མ་ ཡིན་ ནོ །_།
en: Since the lack of a self and the lack of anything belonging to a self has never arisen or come into existence throughout the three times, it is inappropriate for the wise and circumspect to believe in a self, thinking, ‘This is mine,’ ‘This is me,’ |#| or ‘This possession of mine exists.’

source: དེ་སྲིད་པ་ ཐམས་ཅད་ དང་ །_ འདུ་བྱེད་ ཐམས་ཅད་ ལ་ བདག་མེད་པ འི་ འདུ་ཤེས་ དང་ །_ |#| འདོད་ཆགས་ དང་ བྲལ་བ འི་ འདུ་ཤེས་ དང་ །_ སྤངས་ [177a] པ འི་ འདུ་ཤེས་ དང་ །_ |#| འགོག་པ འི་ འདུ་ཤེས་ ཅན་ དུ་ གནས་ ཏེ
en: $121 “Bodhisattvas maintain the perception that all existences and conditioned phenomena are devoid of self, |#| the perception of being free of attachment toward them, [177.a] the perception of having discarded them, and |#| the perception of their cessation;

source: འགོག་པ་ མངོན་སུམ་ དུ་ བྱེད་པ་ ཡང་ མ་ ཡིན་ ནོ །_།
en: it is not the case, however, that cessation is made manifest.

source: གང་དེ་ ལྟར་ དུས་གསུམ་ རབ་ཏུ་ ཤེས་པ་ དེ་ ཆོས་ དེ་དག་ ཉན་ ཅིང་ འཛིན་པ་ དང་ །_ མང་ དུ་ བྱེད་ ཅིང་ ཡོངས་སུ་ རྟོག་པ་ ན་ ཐེག་པ་ གསུམ་ རབ་ཏུ་ ཤེས་ ཏེ །_
en: $122 “When bodhisattvas, who thus understand the three times, hear those teachings and, retaining them, study and consider them, they come to understand the three vehicles.

source: ལྷ འི་ ཐེག་པ་ དང་ །_ ཚངས་པ འི་ ཐེག་པ་ དང་ །_ འཕགས་པ འི་ ཐེག་པ་ སྟེ །_ དེ་དག་ ནི་ ཐེག་པ་ གསུམ་ ཞེས་ བྱ འོ །_།
en: The three vehicles refers to the Gods’ Vehicle, Brahmā’s Vehicle, and the Noble Ones’ Vehicle.

source: བསམ་གཏན་ དང་པོ་ ནི་ ལྷ འི་ ཐེག་པ་ སྟེ །_ བསམ་གཏན་ གཉིས་པ་ དང་ །_ གསུམ་པ་ དང་ །_ བཞི་པ་ ཡང་ ལྷ འི་ ཐེག་པ འོ །_།
en: The Gods’ Vehicle is the first concentration, as well as the second, third, and fourth concentrations.

source: བྱམས་པ་ ནི་ ཚངས་པ འི་ ཐེག་པ་ སྟེ །_ སྙིང་རྗེ་ དང་ །_ དགའ་བ་ དང་ །_ བཏང་སྙོམས་ ཀྱང་ ཚངས་པ འི་ ཐེག་པ འོ །_།
en: Brahmā’s Vehicle is love, as well as compassion, joy, and impartiality.

source: ཡང་དག་པ འི་ ལྟ་བ་ དང་ །_ ཡང་དག་པ འི་ རྟོག་པ་ དང་ །_ ཡང་དག་པ འི་ ངག་ དང་ །_ ཡང་དག་པ འི་ ལས་ ཀྱི་ མཐའ་ དང་ །_ ཡང་དག་པ འི་ འཚོ་བ་ དང་ །_ ཡང་དག་པ འི་ རྩོལ་བ་ དང་ །_ ཡང་དག་པ འི་ དྲན་པ་ དང་ །_ ཡང་དག་པ འི་ ཏིང་ངེ་འཛིན་ ཅེས་བྱ་བ་ འཕགས་པ འི་ ལམ་ ཡན་ལག་ བརྒྱད་པ་ ཞེས་ བྱ་བ་ དེ་ ནི་ འཕགས་པ འི་ ཐེག་པ་ ཞེས་ བྱ འོ །_།
en: The Noble Ones’ Vehicle is the eightfold path of the noble ones: right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right absorption.

source: དེ་དུས་ དུས་ སུ་ ལྷ འི་ ཐེག་པ་ སྒོམ་ སྟེ་ སེམས་ཅན་ རྣམས་ ཀྱང་ དེ་ ལ་ འགོད །_ དུས་ དུས་ སུ་ ཚངས་པ འི་ ཐེག་པ་ སྒོམ་ སྟེ །_ |#| སེམས་ཅན་ རྣམས་ ཀྱང་ དེ་ ལ་ འགོད །_
en: $123 “Bodhisattvas sometimes cultivate the Gods’ Vehicle and establish beings in it; sometimes they cultivate Brahmā’s Vehicle and establish beings in it;

source: དུས་ དུས་ སུ་ འཕགས་པ འི་ ཐེག་པ་ སྒོམ་ ཞིང་ སེམས་ཅན་ རྣམས་ ཀྱང་ དེ་ ལ་ འགོད་ ལ །_ རྣམ་པར་ གྲོལ་བ་ འཕགས་པ་ མངོན་སུམ་ དུ་ ཡང་ མི་ བྱེད་ དོ །_།
en: and sometimes they cultivate the Noble Ones’ Vehicle and establish beings in it. And yet, they do not make manifest the liberation of the noble ones.

source: གཞན་ ཡང་ ཐེག་པ་ གསུམ་ རབ་ཏུ་ ཤེས་ ཏེ །_
en: $124 “Furthermore, they also know three further vehicles.

source: ཉན་ཐོས་ ཀྱི་ ཐེག་པ་ དང་ །_ རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ དང་ །_ ཐེག་པ་ ཆེན་པོ་ སྟེ །_ དེ་དག་ ནི་ ཐེག་པ་ གསུམ་ ཞེས་ བྱ འོ །_།
en: These three vehicles are the Hearers’ Vehicle, the Solitary Buddhas’ Vehicle, and the Great Vehicle.

source: མོས་པ་ དམན་པ་ དང་ །_ དབང་པོ་ དམན་པ་ སྐད་ཅིག་ ཙམ་ ཡང་སྲིད་པ་ ལ་མོ ས་ པར་ མི་ བྱེད །_ སྲིད་པ ར་ མི་ བྱེད་ ཀྱི་ འདོར་ ཏེ །_ |#| སྐད་ཅིག་ དེ་ ལ་ དེ་ མ་ ཐག་ ཏུ་ མྱ་ངན་ ལས་ འདས་པ་ ཐོབ་པ འི་ ཕན་ཡོན་ མཐོང་བ ས་ མགོ་ དང་ གོས་ ལ་ མེ་ འབར་བ་ བཞིན་ དུ་ འཕགས་པ འི་ བདེན་པ་ བཞི་པོ་ དག་ ཁོང་ དུ་ ཆུད་པ་ དང་ །_ རྟོག་པ ར་ བྱ་བ འི་ ཕྱིར་ འདུན་པ་ དང་ །_ རྩོལ་བ འི་ ཤས་ ཆེ་བ་ དེ་ ནི་ ཉན་ཐོས་ ཀྱི་ ཐེག་པ་ ཞེས་ བྱ འོ །_།
en: $125 “The Hearers’ Vehicle pertains to those with lesser inclinations and faculties who have not a mere moment’s interest in existence, and do not perpetuate existence, but reject it. |#| Through seeing the advantages of attaining nirvāṇa, it is as if their hair and clothes were on fire—they acquire the strongest of intentions and efforts to comprehend and realize#40 the four truths of noble beings.

source: མོས་པ་ འབྲིང་ དང་ །_ དབང་པོ་ འབྲིང་ དང་ །_ དབེན་པ ར་ དགའ་བ་ དང་ །_ རང་ གི་ དོན་ ལྷུང་ ལེན་པ་ དང་ །_ བསམ་ [177b] གཏན་ དང་ །_ |#| སྙོམས་པ ར་ འཇུག་པ་ ལ་ གནས་པ ར་ བརྩོན་པ་ དང་ །_ |#| རྟེན་ ཅིང་ འབྲེལ་ པར་ འབྱུང་བ་ རབ་ཏུ་ རྣམ་པར་ འབྱེད་པ་ ལ་ མཁས་པ་ དང་ །_ རང་ བྱང་ཆུབ་ ཏུ་ སྨོན་པ་ དང་ །_ |#| རང་ བྱང་ཆུབ་ ཏུ་ སྨོན་ལམ་ འདེབས་པ་ དེ་ ནི་ རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ ཞེས་ བྱ འོ །_།
en: $126 “The Solitary Buddhas’ Vehicle pertains to those with middling inclinations and faculties, who delight in solitude, are devoted to their own aims, |#| strive to dwell in the concentrations and attainments, [177.b] |#| are skilled in discerning dependent origination, |#| and wish and make aspirations for their own awakening.

source: མོས་པ་ ཁྱད་པར་ དུ་ འཕགས་པ །_ དབང་པོ་ ཁྱད་པར་ དུ་ འཕགས་པ །_ |#| སེམས་ཅན་ ཐམས་ཅད་ བསྒྲལ་བ་ དང་ །_ སེམས་ཅན་ ཐམས་ཅད་ དགྲོལ་བ་ དང་ །_ སེམས་ཅན་ ཐམས་ཅད་ དབུགས་དབྱུང་བ་ དང་ །_ ཐམས་ཅད་ མཁྱེན་པ་ ཉིད་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ སངས་རྒྱས་ ཀྱི་ ཆོས་ ཐམས་ཅད་ ཡོངས་སུ་ བསྐང་བ ར་ འདོད་པ་ དང་ །_ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ དྲུག་ ཡོངས་སུ་ བསྐང་བ ར་ འདོད་པ་ དང་ །_ |#| འཇིག་རྟེན་ གྱི་ དོན་ དུ་ འཁོར་བ འི་ སྡུག་བསྔལ་ ལ་ མི་ལྟ་བ་ དང་ །_ |#| འཁོར་བ འི་ བདེ་བ་ ལ་ ཡང་ དམོད་པ་ མང་བ་ ཡིན་ ན་ འཁོར་བ འི་ སྡུག་བསྔལ་ ལ་ དམོད་པ་ མང་བ་ ལྟ་ སྨོས་ ཀྱང་ ཅི་ དགོས་ ཏེ |#| ཚུལ་ཁྲིམས་ དང་ སྤྱོད་པ་ ཁྱད་པར་ དུ་ འཕགས་པ་ ལ་ རྣམ་པར་ གནས་པ་ དང་ །_ |#| རྫོགས་པ འི་ བྱང་ཆུབ་ ཀྱི་ ཐེག་པ་ ཅན་ གྱི་ མདོ་སྡེ་ རྣམས་ ཀློག་པ་ དང་ །_ ཁ་ཏོན་ དུ་ བྱེད་པ་ དང་ །_ ལུང་ ནོད་པ་ དང་ །_ ཡིད་ ལ་ བྱེད་པ་ རྣམས་ ལ་ བརྩོན་འགྲུས་ བརྩམས་པ་ དང་ །_ |#| བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ གང་ཡིན་པ་ དེ་དག་ དགེ་བ འི་ བཤེས་གཉེན་ ཡིན་པ་ དང་ །_ |#| དེ་དག་ གི་ བྱིན་ གྱི་ རླབས་ བཞི་པོ་ བདེན་པ་ དང་ །_ གཏོང་བ་ དང་ །_ ཉེ་བ ར་ ཞི་བ་ དང་ །_ ཤེས་རབ་ ལ་ སློབ་པ་ དང་ །_ |#| ཤེས་བྱ་ ཐམས་ཅད་ ཉེན་པ་ དང་ །_ ལེན་པ་ དང་ །_ འཛིན་པ་ དང་ །_ དཔྱོད་པ ར་ དགའ་བ་ དང་ །_ ཏིང་ངེ་འཛིན་ དང་ །_ |#| སྙོམས་པ ར་ འཇུག་པ་ ཐམས་ཅད་ ཡང་དག་ པར་ བསྐྱེད་པ ར་ འདོད་པ་ དང་ །_ རང་ གི་ དོན་ ལ་ མི་ལྟ་བ་ དང་ །_ འཇིག་རྟེན་ གྱི་ དོན་ ལྷུར་ལེན་པ་ དང་ །_ སྟོབས་ ཇི་ལྟ་བ་ བཞིན་ དུ་ སེམས་ཅན་ ཐམས་ཅད་ ཐེག་པ་ གསུམ་པོ་ དག་ ལ་ དགོད་པ ར་ འདོད་པ་ དང་ །_ དགོད་པ ར་ སྤྲོ་བ་ དང་ །_ |#| བདག་ཉིད་ ཀྱང་ བྱང་ཆུབ་ ཀྱི་ ཐེག་པ་ ལ་ ཤིན་ཏུ་ གནས་པ་ དང་ །_ མི་ཕྱེད་པ་ དང་ །_ མི་བསྐྱོད་པ་ དང་ །_ རྡོ་རྗེ་ ལྟ་བུ འི་ སེམས་ དང་ །_ རྟག་པ ར་ རྒྱུན་ ཏུ་ བྱང་ཆུབ་ ཏུ་ སྨོན་ ཅིང་ བྱང་ཆུབ་ ཏུ་ སྨོན་ལམ་ འདེབས་པ་ དེ་ ནི་ ཐེག་པ་ ཆེན་པོ་ ཞེས་ བྱ་ སྟེ
en: $127 “The Great Vehicle pertains to those with especially exalted inclinations and faculties, |#| who wish to fulfill all the qualities of a buddha and all six perfections so that all sentient beings may be ferried across, liberated, relieved, and obtain omniscience. |#| It pertains to those who, for the benefit of the world, disregard the suffering of saṁsāra, and |#| have much contempt for the pleasures of saṁsāra, let alone its sufferings. |#| It pertains to those who observe superior conduct and ethical discipline, and |#| who endeavor to chant, recite, explain, and reflect upon#41 the sūtras about the Perfect Awakening Vehicle. |#| It also pertains to bodhisattva great beings who are virtuous spiritual friends, |#| train in the four kinds of blessing—truth, generosity, tranquility, and insight—and |#| hear, receive, memorize, and enjoy analyzing all objects of knowledge. |#| It pertains to those who wish to authentically cultivate all absorptions and attainments, who disregard their own welfare and strive for the welfare of the world, and who wish to establish, and delight in establishing, all beings in the three vehicles in accordance with their capacity. |#| It also pertains to those who themselves firmly adhere to the vehicle of awakening, and with steadfast, unshakable, and vajra-like minds, continuously wish and make aspirations for awakening.

source: དེ་ལྟ ར་ ཐེག་པ་ གསུམ་པོ་ དག་ རབ་ཏུ་ ཤེས་ སོ །_།
en: This is how bodhisattvas understand the three vehicles.

source: [178a] དེ་ ཆོས་ དེ་དག་ ཉན་ ཅིང་ འཛིན་པ་ མང་ དུ་ བྱེད་ ཅིང་ ཡོངས་སུ་ རྟོག་པ་ ན་ དགེ་བ འི་ ཐབས་ རབ་ཏུ་ ཤེས་ ཏེ །_
en: [178.a] $128 “When bodhisattvas hear those teachings and, retaining them, study and consider them, they come to understand the virtuous method:

source: སངས་རྒྱས་ དང་ །_ ཆོས་ དང་ །_ དགེ་འདུན་ ཐམས་ཅད་ ལ་ ཕྱག་ འཚལ་ ལོ །_།
en: prostrating to the Buddha, Dharma, and Saṅgha.

source: འཇིག་རྟེན་ གྱི་ ཁམས་ ཐམས་ཅད་ དུ་ གཏོགས་པ་ འདས་པ་ དང་ །_ མ་འོངས་པ་ དང་ །_ ད་ལྟ ར་ བྱུང་བ འི་ སངས་རྒྱས་ ཐམས་ཅད་ དང་ །_ ཆོས་ ཐམས་ཅད་ དང་ །_ དགེ་འདུན་ ཐམས་ཅད་ ལ་ ཕྱག་ འཚལ་ ལོ །_། ཞེས་ དམིགས་པ ར་ བྱེད་ དོ །_།
en: They do so by observing as follows: ‘I prostrate to all the past, future, and present buddhas, dharmas, and saṅghas throughout all the world systems.’

source: དེ་ ཕྱག་ལན་ ཅིག་ འཚལ་བ་ ན་ མཐའ་ ཡ ས་ ཤིང་ དཔག་ ཏུ་ མེད་པར་ ཕྱག་ འཚལ་བ ར་ བྱ འོ་ སྙམ་ དུ་ སེམས་བསྐྱེད་ དོ །_།
en: When practicing a single prostration, they form the intention of awakening, imagining that they prostrate boundlessly and immeasurably.

source: དེ་ བྱང་ཆུབ་ ཏུ་ སྨོན་པ་ ན་ སེམས་ཅན་ ཐམས་ཅད་ བསྒྲལ་བ་ དང་ །_ སེམས་ཅན་ ཐམས་ཅད་ དགྲོལ་བ་ དང་ །_ སེམས་ཅན་ ཐམས་ཅད་ དབུགས་དབྱུང་བ་ དང་ །_ ཐམས་ཅད་ མཁྱེན་པ་ ཉིད་ ཐོབ་པ ར་ བྱ་བ་ དང་ །_ སངས་རྒྱས་ ཀྱི་ ཆོས་ ཐམས་ཅད་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱ་བ འི་ ཕྱིར་ ཡོངས་སུ་ སྔོ་བ ར་ བྱེད་ དོ །_།
en: When aspiring for awakening, they dedicate it so that all beings may be ferried across, liberated, relieved, attain omniscience, and perfect all the qualities of a buddha.

source: དེ་བཞིན་ དུ་ སྐྱབས་ སུ་ འགྲོ་བ་ ན་ ཡང་ སེམས་བསྐྱེད་ དོ །_།
en: Similarly, when going for refuge they also form the intention of awakening.

source: དེ་ འགྲོ་བ་ དང་ །_ འགྲེང་བ་ དང་ །_ འདུག་པ་ དང་ །_ ཉལ་བ་ དང་ །_ ཁྲུས་ བྱེད་པ་ དང་ །_ ཟ་བ་ དང་ །_ འཐུང་བ་ དང་ །_ ཞིང་ རྨེད་པ་ དང་ །_ ས་བོན་ འདེབས་པ་ དང་ །_ ལས་ ཐམས་ཅད་ བྱེད་པ་ ན་ ཡང་ མཐའ་ ཡ ས་ ཤིང་ དཔག་ ཏུ་ མེད་པར་ བྱང་ཆུབ་ ཏུ་ སྨོན་ལམ་ གདབ་པ ར་ བྱ འོ་ ཞེས་ སེམས་བསྐྱེད་ དོ །_། མང་ དུ་ བྱེད་ དོ །_།
en: When practicing any activity—walking, standing, sitting, sleeping, washing, eating, drinking, plowing the fields, or planting seeds—they form and cultivate the mind of awakening through making aspirations for awakening boundlessly and immeasurably.

source: སྙོམས་པ ར་ འཇུག་པ་ དང་ །_ བསམ་གཏན་ བྱེད་པ་ ན་ ཡང་ སེམས་ཅན་ ཐམས་ཅད་ བསྒྲལ་བ་ དང་ །_ སེམས་ཅན་ ཐམས་ཅད་ དགྲོལ་བ་ དང་ །_ སེམས་ཅན་ ཐམས་ཅད་ དབུགས་དབྱུང་བ་ དང་ །_ ཐམས་ཅད་ མཁྱེན་པ་ ཉིད་ ཐོབ་པ ར་ བྱ་བ་ དང་ །_ སངས་རྒྱས་ ཀྱི་ ཆོས་ ཐམས་ཅད་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱ་བ འི་ ཕྱིར་ མཐའ་ ཡ ས་ ཤིང་ དཔག་ ཏུ་ མེད་པར་ བྱང་ཆུབ་ ཏུ་ སྨོན་ལམ་ གདབ་བོ་ ཞེས་ སེམས་བསྐྱེད་ དོ །_། མང་ དུ་ བྱེད་ དོ །_།
en: $129 “When practicing meditative equipoise and concentration, they also form and cultivate the mind of awakening by making aspirations for awakening, boundlessly and immeasurably, that all beings may be ferried across, liberated, relieved, attain omniscience, and perfect all the qualities of a buddha.

source: ཐམས་ཅད་ མཁྱེན་པ་ ཉིད་ དང་ །_ འཇིག་རྟེན་ ཐམས་ཅད་ ཀྱི་ མཆོག་ དང་ །_ སེམས་ཅན་ ཐམས་ཅད་ གདུལ་བ་ དང་ །_ མཚུངས་པ་ མེད་པ་ དང་ །_ མི་མཉམ་པ་ དང་ མཉམ་པ་ དང་ །_ འཇིག་རྟེན་ ཐམས་ཅད་ དབུགས་དབྱུང་བ་ དང་ །_ འཇིག་རྟེན་ ཐམས་ཅད་ ཡོངས་སུ་ མྱ་ངན་ ལས་ [178b] བཟླ་བ་ དང་ །_ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ དང་ །_ སངས་རྒྱས་ ཀྱི་ ཆོས་ ཐམས་ཅད་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱ་བ འི་ ཕྱིར་ སྨོན་ལམ་ གདབ་པོ་ ཞེས་ སེམས་བསྐྱེད་ དོ །_། མང་ དུ་ བྱེད་ དོ །_།
en: $130 “They arouse and cultivate the mind of awakening by making aspirations to completely perfect all the qualities of a buddha—an omniscient one who is supreme throughout the whole world, a tamer of all beings, a peerless one, an incomparable one, a reliever of the whole world, a liberator of the whole world, a [178.b] truly complete buddha.

source: དེ་ དགེ་བ་ གང་ཅི་ སྤྱོད་ ཀྱང་ དེ་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ འཇིགས་པ་ མེད་པར་ བྱ་བ་ དང་ །_ |#| ངན་འགྲོ འི་ རྒྱུད་ གཅད་པ་ དང་ །_ |#| སྡུག་བསྔལ་ ཐམས་ཅད་ ཉེ་བ ར་ ཞི་བ ར་ བྱ་བ་ དང་ །_ ཉོན་མོངས་པ་ ཐམས་ཅད་ ཉེ་བ ར་ ཞི་བ ར་ བྱ་བ་ དང་ །_ |#| མྱ་ངན་ ལས་ འདས་པ་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ ཡོངས་སུ་ སྔོ་བ ར་ བྱེད་ དོ །_།
en: $131 “Whatever virtue bodhisattvas practice, they dedicate it so that all beings will be free of fear, |#| their chain of bad destinies will be severed, |#| their sufferings and afflictions will be utterly pacified, and |#| they will attain nirvāṇa.

source: ཉན་ཐོས་ ཀྱི་ ཐེག་པ་ ཅན་ ད་ལྟ ར་ བྱུང་བ་ དང་ །_ མ་འོངས་པ་ རྣམས་ ཀྱི་ ཉན་ཐོས་ ཀྱི་ ཐེག་པ་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱ་བ འི་ ཕྱིར་ ཡོངས་སུ་ སྔོ་བ ར་ བྱེད་ དོ །_།
en: $132 “They dedicate it so that those belonging to the Hearers’ Vehicle now and in the future will complete the Hearers’ Vehicle.

source: རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ ཅན་ ད་ལྟ ར་ བྱུང་བ་ དང་ །_ མ་འོངས་པ་ རྣམས་ ཀྱི་ རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱ་བ འི་ ཕྱིར་ ཡོངས་སུ་ སྔོ་བ ར་ བྱེད་ དོ །_
en: They dedicate it so that those belonging to the Solitary Buddhas’ Vehicle now and in the future will complete the Solitary Buddhas’ Vehicle.

source: བྱང་ཆུབ་ སེམས་དཔ འི་ ཐེག་པ་ ཅན་ ད་ལྟ ར་ བྱུང་བ་ དང་ །_ མ་འོངས་པ་ རྣམས་ ཀྱི་ བྱང་ཆུབ་ སེམས་དཔ འི་ ཐེག་པ་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱ་བ འི་ ཕྱིར་ ཡོངས་སུ་ སྔོ་བ ར་ བྱེད་ དོ །_།
en: They dedicate it so that those belonging to the Bodhisattvas’ Vehicle now and in the future will complete the Bodhisattvas’ Vehicle.

source: དེ་བཞིན་ གཤེགས་པ་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཐམས་ཅད་ དུ་ གཏོགས་པ་ འདས་པ་ དང་ །_ མ་ བྱོན་པ་ དང་ །_ ད་ལྟ ར་ བྱུང་བ་ རྣམས་ བསྐལ་པ ར་ བཞུགས་པ་ དང་ །_ བསྐལ་པ ར་ ཆོས་སྟོན་པ་ དང་ །_ བསྐལ་པ ར་ དགེ་འདུན་ འཐུན་ པར་ གྱུར་པ ར་ ཡོངས་སུ་ སྔོ་བ ར་ བྱེད་ དོ །_།
en: They dedicate it so that past, future, and present thus-gone ones throughout all world systems will remain for an eon, teach the Dharma for an eon, and their saṅghas will be harmonious for an eon.

source: མཐོ་རིས་ ཀྱི་ ལམ་ ལ་ དགོད་པ འམ །_ ཉན་ཐོས་ ཀྱི་ ལམ་ ལ་ དགོད་པ འམ །_ རང་ སངས་རྒྱས་ ཀྱི་ ལམ་ ལ་ དགོད་པ འམ །_ རྫོགས་པ འི་ བྱང་ཆུབ་ ཀྱི་ ལམ་ ལ་ དགོད་པ འམ །_ |#| སྦྱིན་པ ས་ རྗེས་སུ་ འཇུག་པ འམ །_ སྙན་པ ར་ སྨྲ་བ ས་ རྗེས་སུ་ འཇུག་པ འམ །_ དོན་ སྤྱོད་པ ས་ རྗེས་སུ་ འཇུག་པ འམ །_ དོན་ འཐུན་ པས་ རྗེས་སུ་ འཇུག་པ འམ །_ |#| ཇི་ལྟ་ ཇི་ལྟ ར་ གཞན་དག་ དགེ་བ འི་ ཕྱོགས་ ཡང་དག་ པར་ སྐྱེད་ ཅིང་ དགེ་བ འི་ རྩ་བ་ སོགས་ པར་ འགྱུར་བ་ དེ་ཡང་ རབ་ཏུ་ ཤེས་ སོ །_།
en: $133 “Bodhisattvas also understand that establishing beings on the path of the higher realms, the path of hearers, the path of solitary buddhas, or the path of perfect awakening; |#| or conforming with beings through generosity, pleasant speech, meaningful conduct, or practicing what they preach; |#| or anything else, for that matter, as appropriate, can truly give rise to virtuous factors and become roots of virtue and the like.

source: དེ་ ཆོས་ ཀྱི་ ཚིག་ འདི་དག་ ལ་ ཉིན་ ཅིག་ བཞིན་ དུ་དུ ས་ གསུམ་ དུ་ འཇུག་ གོ་ ཡིད་ ལ་ བྱེད་ དོ །_།
en: $134 “Bodhisattvas think, ‘I will practice these Dharma verses three times daily.’

source: དེ་ འདི་ལྟ་སྟེ །_
en: The verses are as follows:

source: འཇིག་རྟེན་ དག་ གི་ [179a] ཁམས་ རྣམས་ ཐམས་ཅད་ ན །_། ཡང་དག་ བཞུགས་པ་ རྫོགས་པ འི་ སངས་རྒྱས་ དང་ །_། ཆོས་ དང་ དགེ་འདུན་ བྱང་ཆུབ་ སེམས་དཔའ་ ལ །_། གན་ འགྲོ་ མགོ་བོ ས་ མཐའ་ ཡ ས་ ཕྱག་ ཀྱང་ འཚལ །_།
en: [179.a] “Wherever#42 I wander, I bow my head infinite times To the perfect Buddhas, Dharmas, Saṅghas, |#| And bodhisattvas dwelling Throughout every world system.

source: འགྲོ་བ འི་ ནང་ ན་ ཡོན་ཏན་ མཉམ་མེད་ ཅིང་ །_། མི་ མཉམ་ མཉམ་པ འི་ ཡོན་ཏན་ འབྱུང་གནས་པོ །_། ཡོན་ཏན་ དཔག་མེད་ དེ་དག་ ཐམས་ཅད་ ལ །_། བདག་ ནི་ མགོ་བོ ས་ མཐའ་ ཡ ས་ སྐྱབས་ སུ་ མཆི །_།
en: $135 “I reverentially go for refuge infinite times To all those whose qualities are unequaled among beings, |#| To the sources of incomparable qualities, And to those possessing immeasurable qualities.

source: སངས་རྒྱས་ དང་ ནི་ ཆོས་ དང་ ཚོགས་ རྣམས་ དང་ །_། བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱིས་ འཇིག་རྟེན་ ཁམས །_། གང་ཡང་ བརྒྱ་ལམ་ སྟོངས་པ ར་ མི་འགྱུར་བ ར །_། དེ་ལྟ ར་ གསོལ་བ་ མཐའ་ ཡ ས་ རབ་ཏུ་ འདེབས །_།
en: $136 “I make infinite supplications That no world system whatsoever, Even rarely, be bereft Of the Buddha, Dharma, Saṅgha, and bodhisattvas!

source: ཞི་བ འི་ ཆོས་ ནི་ རབ་ཏུ་ སྟོན་ མཛད་ ཅིང་ །_། |#| བསྐལ་པ་ མ་ ལུས་ རྣམས་ སུ་ བཞུགས་པ ར་ ཡང་ །_། འཇིག་རྟེན་ ཁམས་ རྣམས་ ཀུན་ གྱི་ བདེ་གཤེགས་ ལ །_། མགོ་བོ ས་ གསོལ་བ་ མཐའ་ ཡ ས་ རབ་ཏུ་ འདེབས །_།
en: $137 “I reverentially make infinite supplications To the blissful ones throughout all the world systems, So that they remain for every eon Teaching the tranquil Dharma!

source: སྔོན་ དང་ འདི་ དང་ སྐད་ཅིག་ ཙམ་ ཡང་ རུང་ །_། བདག་ གིས་ སྡིག་པ་ གང་དང་གང་ བགྱིས་པ །_། སྡིག་པ་ དེ་དག་ ཐམས་ཅད་ སྨད་པ ར་ བགྱི །_། སྡིག་པ་ ཐམས་ཅད་ བདག་ གིས་ སྤང་བ ར་ བགྱི །_།
en: $138 “I condemn And abandon all evil deeds— Each and every negative deed I have ever committed In the past and present, however momentary!

source: སྐད་ཅིག་ ཙམ་ ཡང་ བདག་ གིས་ དགེ་བ་ འདི །_། མ་ལུས་པ ར་ ནི་ ཡང་དག་ གཟུང་བ ར་ བགྱི །_།
en: $139 “I will wholly embrace virtue, However momentary.

source: ཚེ་ ཡིས་ ཇི་ཙམ་ ཐུབ་ ཀྱི་ བར་ དུ་ ནི །_། དགེ་བ་ ཀུན་ ལ་ གནས་པ ར་ འགྱུར་བ ར་ འཚལ །_།
en: In this life, for as long as I shall live, May I abide by all virtues!

source: སངས་རྒྱས་ དག་ དང་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས །_། བྱང་ཆུབ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ རབ་ བསྐོར་བ །_། འཇིག་རྟེན་ འདིར་ ནི་ བྱུང་ དང་ བྱུང་ འགྱུར་ དང་ །_། འབྱུང་འགྱུར་ རྣམས་ ཀྱི་ དགེ་བ་ ཐམས་ཅད་ དང་ །_།
en: $140 “May all the virtues Of the buddhas and bodhisattvas, Past, present, and yet to come to this world, Who turn the wheel of the Dharma of awakening,

source: རྒྱལ་བ་ རྣམས་ དང་ འཕགས་པ་ ཐམས་ཅད་ ཀྱི །_། ཚུལ་ཁྲིམས་ དང་ ནི་ ཡེ་ཤེས་ ཏིང་འཛིན་ དང་ །_། རྣམ་གྲོལ་ ཚེ་ དང་ ཆོས་ རྣམས་ གང་ཡིན་པ །_། དེ་དག་ འཇིག་རྟེན་ རྣམས་ ལ་ ཕན་ གྱུར་ཅིག _།
en: $141 As well as the ethical discipline, insight, absorption, Liberation, life, and qualities Of all the victorious and noble ones, Bring benefit to all world systems!

source: འགྲོ་བ་ ལྔ་ ཡི་ སེམས་ཅན་ ཐམས་ཅད་ དག _། བྱུང་ དང་ བྱུང་ གྱུར་ འབྱུང་བ ར་ འགྱུར་ རྣམས་ ཀྱི །_། དགེ་བ་ དག་ ལ་ བདག་ ནི་ ཕྱི་ཕྱིར་ ཞིང་ །_། |#| མགོ་བོ ས་ མཐའ་ ཡ ས་ རྗེས་སུ་ ཡི་ རང་ ངོ་ །_།
en: $142 “I repeatedly and reverentially rejoice, infinite times, |#| In the virtues Of all beings of the five destinies, Past, present, and yet to come!

source: ཡོན་ཏན་ ཡང་དག་ དགེ་བ་ མཐའ་ཡས་པ །_། དེ་དག་ ཐམས་ཅད་ འགྲོ་བ་ མ་ལུས་པ ས །_། སེམས་ཅན་ རེ་རེ་ དང་ ནི་ བདག་ཉིད་ ལ འང་ །_། ཡོད་ [179b] པར་ བདག་ ནི་ སྨོན་ལམ་ མཐའ་ ཡ ས་ འདེབས །_།
en: $143 “I make infinite aspirations |#| That each and every being without exception, Myself included, [179.b] may have all those |#| Authentic qualities and infinite virtues!

source: བདག་ གི་ དགེ་བ་ དག་ ནི་ འདས་པ་ དང་ །_། མ་འོངས་པ་ དང་ ད་ལྟ ར་ ཐམས་ཅད་ ཀྱིས །_།
en: $144 “Through all my virtue From the past, present, and future,

source: འཇིག་རྟེན་ དག་ གི་ ཁམས་ ནི་ ཐམས་ཅད་ དུ །_། དཀོན་མཆོག་ གསུམ་པོ་ རྟག་ ཏུ་ འབྱུང་བ ར་ ཤོག _།
en: May the Three Jewels always appear In every world system!

source: དཀོན་མཆོག་ གསུམ་ དང་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས །_། བསྐལ་པ ར་ བཞུགས་པ ས་ ཕོངས་པ ར་ མ་ གྱུར་ཅིག _།
en: $145 “May we not be bereft for eons Of the Three Jewels’ and bodhisattvas’ presence!

source: བར་ དུ་ གཅོད་པ་ མེད་པར་ བྱང་ཆུབ་ དང་ །_། ཕ་རོལ་ ཕྱིན་པ་ རྣམས་ ནི་ རྫོགས་པ ར་ ཤོག _།
en: May we complete awakening And the perfections without hindrance!

source: སེམས་ཅན་ དག་ ནི་ ཐམས་ཅད་ བདེ་བ་ དང་ །_།
en: $146 “May beings have every happiness,

source: འཇིགས་པ་ མེད་ ཅིང་ ངན་འགྲོ་ འདས་པ་ དང་ །_།
en: Be without fear, transcend the lower realms,

source: མི་དགེ་ ཐམས་ཅད་ དང་ ནི་ བྲལ་བ་ དང་ །_། དགེ་བ འི་ རྩ་བ་ ཐམས་ཅད་ རྫོགས་ གྱུར་ཅིག _།
en: Be free from all non-virtues, And perfect all roots of virtue!

source: ཐེག་པ་ གསུམ་པོ་ དག་ ལ་ ཅི་རིགས་ པར །_། དེ་དག་ ལ་ ནི་ སྨོན་ལམ་ མཐ ར་ ཕྱིན་ ཅིང་ །_།
en: $147 “May they fulfill their aspiration prayers According to all of the three vehicles!

source: ཚེ་རིང་བ་ དང་ རྣམ་པར་ གྲོལ་བ་ དང་ །_། ཁྱད་པར་ཅན་ གྱི་ དོན་ ཀུན་རྫོགས་པ ར་ ཤོག _།
en: May they have long life, liberation, And fulfill their extraordinary purpose!

source: རྫོགས་པ འི་ བྱང་ཆུབ་ སྨོན་ལམ་ འདེབས་པ་ ན །_། མཐའ་ ཡ ས་ དཔག་ ཏུ་ མེད་པར་ རབ་ཏུ་ འདེབས །_།
en: $148 “When making aspirations for complete awakening, May they be cast infinitely and immeasurably!

source: སེམས་ཅན་ ཐམས་ཅད་ དག་ གི་ སྡུག་བསྔལ་ དང་ །_། ཉོན་མོངས་ དག་ ནི་ ཉེ་བ ར་ ཞི་ གྱུར་ཅིག _།
en: May the suffering and afflictions Of all beings be utterly quelled!

source: ཆོས་ དང་ ལྡན་པ འི་ བྱ་བ་ རྣམས་ ཀྱི་ ཕྱིར །_། འཇིག་རྟེན་ དག་ གི་ ཁམས་ རྣམས་ ཐམས་ཅད་ ཀྱི །_། རྒྱལ་བ་ ཀུན་ དང་ བྱང་ཆུབ་ སེམས་དཔའ་ ལ །_། རང་ གི་ ལུས་ ནི་ ངེས་པ ར་ དབུལ་བ ར་ བགྱི །_།
en: $149 “I offer my own body with conviction To all victorious ones and bodhisattvas Of each and every world system For use in actions whose purpose is Dharma!

source: རྫོགས་པ འི་ བྱང་ཆུབ་ ཐོབ་པ ར་ གྱུར་ བར་ དུ །_། མ་འོངས་པ་ ན་ སྨོན་ལམ་ མཐའ་ ཡ ས་ གདབ །_།
en: $150 “I will make infinite aspirations That in the future, until attaining#43 perfect awakening,

source: སྐྱེ་ དང་ སྐྱེ་བ ར་ དཀོན་མཆོག་ གསུམ་པོ་ ལ །_། བདག་ ནི་ ཡོངས་སུ་ སྤྱད་པ ར་ བགྱིད་པ ར་ ཤོག _།
en: I may serve the Three Jewels In each and every lifetime!

source: འཇིག་རྟེན་ དག་ གི་ ཁམས་ རྣམས་ ཐམས་ཅད་ ཀྱི །_། དཀོན་མཆོག་ གསུམ་ དང་ བྱང་ཆུབ་ སེམས་དཔའ་ ལ །_། ནམ་མཁའ་ མཉམ་པ འི་ ལྷ་ ཡི་ སྤོས་ མཆོག་ དང་ །_། ཕྲེང་བ་ མེ་ཏོག་ ཆུན་པོ ས་ མཆོད་ བྱེད་ ཤོག _།
en: $151 “May I worship the Three Jewels and bodhisattvas Of each and every world system With sublime, divine perfume, garlands, and bouquets of flowers Equal to the reaches of the sky!

source: ལྷུན་པོ་ མཉམ་པ འི་ གསེར་ དང་ དངུལ་ དག་ དང་ །_། གོས་ དང་ རིན་པོ་ཆེ་ ཡི་ ཕུང་པོ་ དང་ །_། གཞལ་མེད་ ཁང་ བཅས་ གཞོན་ དང་ མལ་ཆ་ དང་ །_། བཟའ་བ་ མཐའ་ ཡ ས་ དག་ ནི་ སྦྱིན་པ ར་ ཤོག _།
en: $152 “May I give them heaps of silver and gold, Clothing and precious substances, Infinite chariots with steeds,#44 And infinite bedding and food, equal to the reaches of Mount Sumeru!
